Documents/бит_ИсковоеЗаявление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ИсковоеЗаявление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйУчасток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абзац</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеСуда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправленВСуд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсковоеЗаявление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричинаОтмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Печать</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_ИсковоеЗаявление/Ext/ObjectModule.bsl
//ответчики

#Область ПеременныеМодуля

Перем мТаблицаФизЛицДолей Экспорт; // Хранит таблицу физ лиц и долей площади

Перем мНачислениеСУчетомДнейПроживания; // Хранит флаг настройки ЖКХ.

#КонецОбласти
Функция ПолучитьСписокПроживающих(ФизЛицо)
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &ФизЛицо) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент"     , КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"    , ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено
		
	КонецЕсли; 
	
	Возврат РезультатЗапроса.Выгрузить()[0];
	
КонецФункции
Функция ПечатьИсковоеЗаявление(Флаг = Истина) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Момент" ,Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ИсковоеЗаявление.Номер КАК Номер,
	|	бит_ИсковоеЗаявление.СуммаЗадолженности КАК СуммаЗадолженности,
	|	бит_ИсковоеЗаявление.ПериодОбразованияЗадолженностиОт КАК ПериодОбразованияЗадолженностиОт,
	|	бит_ИсковоеЗаявление.ПериодОбразованияЗадолженностиПо КАК ПериодОбразованияЗадолженностиПо,
	|	бит_ИсковоеЗаявление.Госпошлина КАК Госпошлина,
	|	бит_ИсковоеЗаявление.Адрес КАК Адрес,
	|	бит_ИсковоеЗаявление.СудебныйУчасток.НомерУчастка КАК СудебныйУчастокНомерУчастка,
	|	Организации.ИНН КАК ИННОрганизации,
	|	Организации.КПП КАК КППОрганизации,
	|	Банки.Наименование КАК НаименованиеБанка,
	|	Банки.КоррСчет КАК КоррСчет,
	|	Банки.Код КАК БИК,
	|	Банки.Адрес КАК АдресБанка,
	|	лб_Тест_Дома.KR_RS КАК НомерСчета,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадьКвартиры,
	|	бит_ИсковоеЗаявление.Дата КАК Дата,
	|	Банки.ИННБанка КАК ИННБанка,
	|	Банки.ОКПОБанка КАК ОКПОБанка,
	|	Банки.КППБанка КАК КППБанка,
	|	Банки.ОГРНБанка КАК ОГРНБанка,
	|	бит_ИсковоеЗаявление.ПредставительскиеРасходы КАК ПредставительскиеРасходы
	|ИЗ
	|	Документ.бит_ИсковоеЗаявление КАК бит_ИсковоеЗаявление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО бит_ИсковоеЗаявление.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лб_Тест_Дома КАК лб_Тест_Дома
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|				ПО БанковскиеСчета.Банк = Банки.Ссылка
	|			ПО лб_Тест_Дома.ЛицевойСчетКР = БанковскиеСчета.Ссылка
	|		ПО бит_ИсковоеЗаявление.Здание = лб_Тест_Дома.Здание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Период, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_ИсковоеЗаявление.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_ИсковоеЗаявление.Ссылка = &Ссылка";

	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка" ,Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ИсковоеЗаявлениеОтветчики.ФизЛицо.Наименование КАК ФизЛицо,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо.ДатаРождения КАК ФизЛицоДатаРождения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументВид КАК ДокументВид,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо.ИНН КАК ФизЛицоИНН,
	|	бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо.СтраховойНомерПФР КАК ФизЛицоСтраховойНомерПФР
	|ИЗ
	|	Документ.бит_ИсковоеЗаявление.Ответчики КАК бит_ИсковоеЗаявлениеОтветчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Период, ) КАК бит_ПаспортныеДанныеПроживающихСрезПоследних
	|		ПО бит_ИсковоеЗаявлениеОтветчики.ФизЛицо = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо
	|			И бит_ИсковоеЗаявлениеОтветчики.ФизЛицо.ДатаРождения = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо.ДатаРождения
	|			И бит_ИсковоеЗаявлениеОтветчики.ФизЛицо.ИНН = бит_ПаспортныеДанныеПроживающихСрезПоследних.ФизЛицо.ИНН
	|ГДЕ
	|	бит_ИсковоеЗаявлениеОтветчики.Ссылка = &Ссылка";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
КонецФункции



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТекущийДокумент = ДополнительныеСвойства.Документ; 
	ТекущийДокумент = ТекущийДокумент.ПолучитьОбъект();
	ЭтотОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


Функция ПроверкаСвязанныхДокументов()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&Документ) КАК СвязанныеДокументы";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Связь = Истина;
	Иначе 
		Связь = Ложь;
	КонецЕсли;
	Возврат Связь;
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции
